# RemoveBuildingStorey Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ExporterIFC..::..RemoveBuildingStorey Method
ExporterIFC Class See Also
---
Removes an IFCLevelInfo corresponding to a level from the exporter's internal cache.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public void RemoveBuildingStorey(
	ElementId id
)
```

Visual Basic
---
```text
Public Sub RemoveBuildingStorey ( _
	id As ElementId _
)
```

Visual C++
---
```text
public:
void RemoveBuildingStorey(
	ElementId^ id
)
```

# ### Parameters
id
    Type: Autodesk.Revit.DB..::..ElementId The level id.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
ExporterIFC Class
Autodesk.Revit.DB.IFC Namespace